sudo pacman -S

7zip
amd-ucode
awesome-terminal-fonts
base
bitwarden
bluez
bluez-utils
brightnessctl
btop
debugedit
discord
dkms
dmenu
dunst
eza
fakeroot
fastfetch
flameshot
fzf
gimp
grub
gtk-layer-shell
imagemagick
jdk-openjdk
launchy
libva-nvidia-driver
linux-lts
luacheck
luarocks
ly
mesa-utils
mpv
nano
neovim
network-manager-applet
niri
nodejs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
nvidia-open-lts
nvidia-prime
obs-studio
obsidian
picom
pipewire
pipewire-alsa
pipewire-pulse
pkgconf
playerctl
polkit-gnome
quickshell
redshift
ripgrep
rofi
sof-firmware
stow
stylua
trash-cli
ttc-iosevka
ttf-dejavu
ttf-dejavu-nerd
ttf-font-awesome
ttf-iosevka-nerd
ttf-iosevkaterm-nerd
ttf-iosevkatermslab-nerd
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-liberation-mono-nerd
unzip
vlc
vulkan-tools
wget
woff2-font-awesome
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xorg-xinit
xorg-xset
yazi
yt-dlp
zram-generator


-- wayland specific
cliphist
hyprlock
swaybg
wl-clip-persist
wl-clipboard
xwayland-satellite
