7zip
alacritty
amd-ucode
bash-completion
btop
cliphist
discord
dmenu
dunst
fd
feh
fzf
gimp
git
gnome-keyring
google-java-format
hyprlock
jdk-openjdk
lazygit
libnotify
luarocks
neovim
nodejs
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
noto-fonts-sc
npm
obs-studio
obsidian
polkit-gnome
qt5ct
qt6-wayland
quickshell
reflector
ripgrep
rofi
shfmt
stow
stylua
trash-cli
ttc-iosevka
ttf-dejavu
ttf-dejavu-nerd
ttf-iosevka
ttf-iosevka-nerd
ttf-iosevkaterm-nerd
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-liberation
unzip
xclip
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-gnome
xorg-xwayland
xwayland-satellite
yazi
yt-dlp
